In [3]:
import pandas as pd

In [1]:
icecream = ["Chocolate", "Vanilla", "Strawberry", "Rum"]

In [4]:
pd.Series(icecream)

0     Chocolate
1       Vanilla
2    Strawberry
3           Rum
dtype: object

In [7]:
dict1 = {
    "One": "Blues",
    "Two": "Red",
    "Three": "Black"
}

In [8]:
pd.Series(dict1)

One      Blues
Two        Red
Three    Black
dtype: object

In [11]:
numbers = [1, 2, 4, 9, 16, 25, 36, 49, 64, 81]

In [13]:
lista1 = pd.Series(numbers)

In [14]:
lista1.sum()

287

In [15]:
lista1.mean()

28.7

In [16]:
lista1.product()

263363788800

In [18]:
lista1.is_unique

True

In [19]:
lista1.index

RangeIndex(start=0, stop=10, step=1)

In [23]:
fruits = ["Apples", "Banana", "Orange"]
colors = ["Red", "Yellow", "Green"]
pd.Series(data = fruits, index = colors)

Red       Apples
Yellow    Banana
Green     Orange
dtype: object

In [64]:
dane1 = pd.read_csv("Dane.csv")
dane1

        Name  Year
0      Linda  1980
1      Susan  1978
2       Lily  1968
3      Jacob  1981
4     George  1982
5      Sarah  1967
6        Tom  1970
7       John  1976
8       Kate  1983
9       Will  1973
10  Margaret  1971
11     Cindy  1987
12      Jake  1990
13      Luke  1987
14     Linda  1982
15      Lily  1983
16     Jacob  1984
17      Kate  1987
18      Kate  1977
19      Jake  1987
20     Jacob  1972
21    George  1979

In [65]:
dane1.head(3)

    Name  Year
0  Linda  1980
1  Susan  1978
2   Lily  1968

In [66]:
dane1.tail(3)

      Name  Year
19    Jake  1987
20   Jacob  1972
21  George  1979

In [87]:
dane1 = pd.read_csv("Dane.csv", usecols = ["Name"]).squeeze()
dane1.sort_index()

0        Linda
1        Susan
2         Lily
3        Jacob
4       George
5        Sarah
6          Tom
7         John
8         Kate
9         Will
10    Margaret
11       Cindy
12        Jake
13        Luke
14       Linda
15        Lily
16       Jacob
17        Kate
18        Kate
19        Jake
20       Jacob
21      George
Name: Name, dtype: object

In [88]:
dane1.sort_values(ascending = False)

9         Will
6          Tom
1        Susan
5        Sarah
10    Margaret
13        Luke
14       Linda
0        Linda
2         Lily
15        Lily
8         Kate
17        Kate
18        Kate
7         John
19        Jake
12        Jake
20       Jacob
3        Jacob
16       Jacob
21      George
4       George
11       Cindy
Name: Name, dtype: object

In [99]:
dane1.head(5)

0     Linda
1     Susan
2      Lily
3     Jacob
4    George
Name: Name, dtype: object

In [90]:
1987 in dane1.values

False

In [91]:
dane1[0:2]

0    Linda
1    Susan
Name: Name, dtype: object

In [84]:
dane1.get("Ala", "None")

'None'

In [85]:
dane1[21] = ["Ala"]

In [86]:
dane1

0        Linda
1        Susan
2         Lily
3        Jacob
4       George
5        Sarah
6          Tom
7         John
8         Kate
9         Will
10    Margaret
11       Cindy
12        Jake
13        Luke
14       Linda
15        Lily
16       Jacob
17        Kate
18        Kate
19        Jake
20       Jacob
21       [Ala]
Name: Name, dtype: object

In [92]:
dane1klon = dane1.copy()

In [94]:
dane1klon[1] = "Meggy"

In [98]:
dane1klon.head(5)

0     Linda
1     Meggy
2      Lily
3     Jacob
4    George
Name: Name, dtype: object

In [97]:
dane1.head(3)

0    Linda
1    Susan
2     Lily
Name: Name, dtype: object

In [103]:
dane2 = dane1.sort_values()

In [104]:
dane2

11       Cindy
21      George
4       George
3        Jacob
16       Jacob
20       Jacob
19        Jake
12        Jake
7         John
18        Kate
17        Kate
8         Kate
2         Lily
15        Lily
0        Linda
14       Linda
13        Luke
10    Margaret
5        Sarah
1        Susan
6          Tom
9         Will
Name: Name, dtype: object

In [105]:
dane2.describe()

count        22
unique       14
top       Jacob
freq          3
Name: Name, dtype: object

In [108]:
dane2.value_counts(normalize = True) * 100

Jacob       13.636364
Kate        13.636364
George       9.090909
Jake         9.090909
Lily         9.090909
Linda        9.090909
Cindy        4.545455
John         4.545455
Luke         4.545455
Margaret     4.545455
Sarah        4.545455
Susan        4.545455
Tom          4.545455
Will         4.545455
Name: Name, dtype: float64

In [114]:
dane1

0        Linda
1        Susan
2         Lily
3        Jacob
4       George
5        Sarah
6          Tom
7         John
8         Kate
9         Will
10    Margaret
11       Cindy
12        Jake
13        Luke
14       Linda
15        Lily
16       Jacob
17        Kate
18        Kate
19        Jake
20       Jacob
21      George
Name: Name, dtype: object

In [118]:
def fun_dan(name):
    if name in ["Jacob", "Kate"]:
        return "One"
    elif name == "John":
        return "Two"
    else:
        return "Three"

dane1.apply(fun_dan)

0     Three
1     Three
2     Three
3       One
4     Three
5     Three
6     Three
7       Two
8       One
9     Three
10    Three
11    Three
12    Three
13    Three
14    Three
15    Three
16      One
17      One
18      One
19    Three
20      One
21    Three
Name: Name, dtype: object